Examinator/src/Catalogs/СсылкиОбъектовСУЗ/СсылкиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СсылкиОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеОкно</name>
    <type>
      <types>EnumRef.ЦелевыеОкнаДляСсылокСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СсылкиОбъектовСУЗ/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Определяем тип объекта
	
	ТипОбъекта = ПолучитьТипОбъекта(Объект.СсылкаНаОбъектСУЗ);
	
	// Вкладка ДополнительноДляПодборок
	
	Если ТипОбъекта = Перечисления.ТипыОбъектовСУЗ.collection
		И НЕ Объект.СсылкаНаОбъектСУЗ.ЭтоТест Тогда
		
		Элементы.ДополнительноДляПодборок.Видимость = Истина;
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.СсылкаНаОбъектСУЗ));
		Элементы.ЭлементПодборки.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	Иначе
		
		Элементы.ДополнительноДляПодборок.Видимость = Ложь;
		
	КонецЕсли;
	
	// Вкладка ДополнительноДляФайлов
	
	Если ТипОбъекта = Перечисления.ТипыОбъектовСУЗ.file Тогда
		Элементы.ДополнительноДляФайлов.Видимость = Истина;
	Иначе
		Элементы.ДополнительноДляФайлов.Видимость = Ложь;
	КонецЕсли;
	
	// СсылкаНаОбъектСУЗ
	
	Если ЗначениеЗаполнено(Объект.ВнешняяСсылка) Тогда
		Элементы.СсылкаНаОбъектСУЗ.Доступность = Ложь;
	Иначе
		Элементы.СсылкаНаОбъектСУЗ.Доступность = Истина;
	КонецЕсли;
	
	// Внешняя ссылка
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъектСУЗ) Тогда
		Элементы.ВнешняяСсылка.Доступность = Ложь;
	Иначе
		Элементы.ВнешняяСсылка.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресСсылки(Ссылка)
	Возврат Справочники.СсылкиОбъектовСУЗ.АдресСсылки(Ссылка);	
КонецФункции

&НаСервереБезКонтекста
Функция АдресЦели(Ссылка)
	Возврат Справочники.СсылкиОбъектовСУЗ.АдресЦели(Ссылка);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипОбъекта(СсылкаНаОбъектСУЗ)
	Возврат ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СсылкаНаОбъектСУЗ);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресСсылки = АдресСсылки(Объект.Ссылка);
	АдресЦели   = АдресЦели(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	АдресСсылки = АдресСсылки(Объект.Ссылка);
	АдресЦели   = АдресЦели(Объект.Ссылка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СсылкаНаОбъектСУЗПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяСсылкаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры
